# imports

## Librairies

In [1]:
import numpy as np
import pandas as pd
import os

In [2]:
os.chdir('C:\\Users\\theos\\Documents\\ETUDES\\EDHEC_MSc\\data_visualization\\project_data_viz')

## Data

### import lieux

In [3]:
os.chdir('lieux')

In [4]:
file_list = list()
for file in os.listdir():
    df = pd.read_csv(file)
    file_list.append(df)
    
df_lieux = pd.concat(file_list, axis=0, ignore_index=True)
df_lieux.head()

C:\anaconda\lib\site-packages\IPython\core\interactiveshell.py:2785: DtypeWarning: Columns (2) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,Num_Acc,catr,voie,v1,v2,circ,nbv,pr,pr1,vosp,prof,plan,lartpc,larrout,surf,infra,situ,env1
0,201000000001,3,39,NaN,NaN,2.0,2.0,0.0,0.0,0.0,1.0,1.0,0.0,60.0,1.0,0.0,1.0,0.0
1,201000000002,3,39,NaN,NaN,2.0,0.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0
2,201000000003,3,41,2.0,NaN,2.0,2.0,0.0,0.0,0.0,1.0,1.0,0.0,61.0,1.0,0.0,1.0,0.0
3,201000000004,3,39,NaN,NaN,2.0,2.0,0.0,0.0,0.0,1.0,1.0,0.0,68.0,1.0,0.0,1.0,0.0
4,201000000005,3,239,NaN,NaN,2.0,1.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0,1.0,0.0,1.0,99.0

### import vehicules

In [5]:
os.chdir('../vehicules')

In [6]:
file_list = list()
for file in os.listdir():
    df = pd.read_csv(file)
    file_list.append(df)
    
df_vehicules = pd.concat(file_list, axis=0, ignore_index=True)
df_vehicules.head()

        Num_Acc  senc  catv  occutc  obs  obsm  choc  manv num_veh
0  201000000001   0.0    30       0  1.0   0.0   1.0   1.0     A01
1  201000000002   0.0     7       0  0.0   1.0   1.0   1.0     A01
2  201000000003   0.0    33       0  0.0   2.0   1.0  17.0     A01
3  201000000003   0.0     7       0  0.0   9.0   3.0  23.0     C03
4  201000000003   0.0     7       0  0.0   9.0   6.0   1.0     B02

### import usagers

In [7]:
os.chdir('../usagers')

In [8]:
file_list = list()
for file in os.listdir():
    df = pd.read_csv(file)
    file_list.append(df)
    
df_usagers = pd.concat(file_list, axis=0, ignore_index=True)
df_usagers.head()

,Num_Acc,place,catu,grav,sexe,trajet,secu,locp,actp,etatp,an_nais,num_veh
0,201000000001,1.0,1,3,1,5.0,21.0,0.0,0.0,0.0,1976.0,A01
1,201000000002,1.0,1,1,2,5.0,11.0,0.0,0.0,0.0,1983.0,A01
2,201000000002,NaN,3,3,1,0.0,NaN,4.0,3.0,1.0,1965.0,A01
3,201000000003,1.0,1,3,1,5.0,23.0,0.0,0.0,0.0,1979.0,A01
4,201000000003,1.0,1,1,2,5.0,11.0,0.0,0.0,0.0,1959.0,C03

### import caracteristiques

In [9]:
os.chdir('../caracteristiques')

In [10]:
file_list = list()
for file in os.listdir():
    index_year = file.find('2')
    year = int(file[index_year:index_year+4])
    df = pd.read_csv(file,encoding = "ISO-8859-1")
    df['annee'] = year
    file_list.append(df)
    
df_caracteristiques = pd.concat(file_list, axis=0, ignore_index=True)
df_caracteristiques.head()

,Num_Acc,an,mois,jour,hrmn,lum,agg,int,atm,col,com,adr,gps,lat,long,dep,annee
0,201000000001,10,6,12,1930,1,2,1,1.0,6.0,52,71 RUE JEAN JAURES,M,0.0,0.0,590,2010
1,201000000002,10,8,7,1000,1,2,1,1.0,6.0,477,Rue Nationale,M,5051600.0,292000.0,590,2010
2,201000000003,10,9,11,1600,1,1,1,1.0,5.0,11,NaN,M,0.0,0.0,590,2010
3,201000000004,10,9,22,1630,1,2,1,1.0,6.0,477,43 rue Nationale,M,5051800.0,292500.0,590,2010
4,201000000005,10,10,25,1215,1,2,1,1.0,2.0,52,RUE GHESQUIERES,M,5050800.0,289700.0,590,2010

In [11]:
os.chdir('..')

### Commune departement region

In [12]:
df_insee = pd.read_csv('code-postal-code-insee-2015-not-modified.csv', sep=";")
df_insee.head(1)

,Geo Point,Geo Shape,ID_GEOFLA,CODE_COM,INSEE_COM,NOM_COM,STATUT,X_CHF_LIEU,Y_CHF_LIEU,X_CENTROID,...,CODE_ARR,CODE_DEPT,NOM_DEPT,CODE_REG,NOM_REG,Ligne_5,Libelle_acheminement,Code_postal,Nom_commune,coordonnees_gps
0,"43.2213812599, -0.229479954692","{""type"": ""Polygon"", ""coordinates"": [[[-0.21425...",COMMUNE00000000000012233,119,64119,BEUSTE,Commune simple,437369,6240814,437816,...,3.0,64,PYRENEES-ATLANTIQUES,75,AQUITAINE-LIMOUSIN-POITOU-CHARENTES,NaN,BEUSTE,64800.0,BEUSTE,"43.2213812599, -0.229479954692"

### Nombre d'habitant par département

In [13]:
df_habitant = pd.read_excel('estimation population 2017.xls')
df_habitant.head()

  code              departement  population
0   01                      Ain      643906
1   02                    Aisne      533679
2   03                   Allier      337439
3   04  Alpes-De-Haute-Provence      162473
4   05             Hautes-Alpes      141390

# Preparation data

## caracteristiques

In [14]:
# Selection useful columns
df_caracteristiques = df_caracteristiques.loc[:,['Num_Acc','jour','mois','lum','dep','atm','col','lat','long','annee']]

In [15]:
# create date
df_caracteristiques['date'] = df_caracteristiques['jour'].map(str) + '/' + df_caracteristiques['mois'].map(str) + '/' + df_caracteristiques['annee'].map(str)

In [16]:
# lattitude
#df_caracteristiques['lat'] = df_caracteristiques['lat'].apply(lambda x: x/100000)
df_caracteristiques['lat'] = df_caracteristiques['lat'].div(100000)

In [17]:
# longitude
df_caracteristiques['long'] = df_caracteristiques['long'].div(100000)

In [18]:
df_caracteristiques = df_caracteristiques.drop(columns=['jour','mois'])

In [19]:
df_caracteristiques[['atm','col']] = df_caracteristiques[['atm','col']].astype('Int64')

In [20]:
df_caracteristiques.loc[df_caracteristiques['lat']==0,'lat']=np.nan
df_caracteristiques.loc[df_caracteristiques['long']==0,'long']=np.nan

In [21]:
df_caracteristiques.head()

        Num_Acc  lum  dep  atm  col     lat   long  annee        date
0  201000000001    1  590    1    6     NaN    NaN   2010   12/6/2010
1  201000000002    1  590    1    6  50.516  2.920   2010    7/8/2010
2  201000000003    1  590    1    5     NaN    NaN   2010   11/9/2010
3  201000000004    1  590    1    6  50.518  2.925   2010   22/9/2010
4  201000000005    1  590    1    2  50.508  2.897   2010  25/10/2010

## lieux

In [22]:
df_lieux = df_lieux.loc[:,['Num_Acc','plan']]

In [23]:
df_lieux[['plan']] = df_lieux[['plan']].astype('Int64')

In [24]:
df_lieux.head()

        Num_Acc  plan
0  201000000001     1
1  201000000002     1
2  201000000003     1
3  201000000004     1
4  201000000005     1

## vehicules

In [25]:
df_vehicules = df_vehicules.loc[:,['Num_Acc','catv']]

In [26]:
df_vehicules.head()

        Num_Acc  catv
0  201000000001    30
1  201000000002     7
2  201000000003    33
3  201000000003     7
4  201000000003     7

## usagers

In [27]:
df_usagers = df_usagers.loc[:,['Num_Acc','grav']]

In [28]:
df_usagers.head()

        Num_Acc  grav
0  201000000001     3
1  201000000002     1
2  201000000002     3
3  201000000003     3
4  201000000003     1

## Insee

In [29]:
df_insee = df_insee.loc[:,['CODE_DEPT','NOM_DEPT']]
df_insee.columns = ['code departement','departement']
df_insee['departement']=df_insee['departement'].str.title()

In [30]:
df_insee['code insee dep'] = df_insee['code departement'] + '0'
df_insee.loc[df_insee['code departement']=='2A','code insee dep']='201'
df_insee.loc[df_insee['code departement']=='2B','code insee dep']='202'
df_insee['code insee dep'] = df_insee['code insee dep'].astype('int64')

In [31]:
df_insee = df_insee.drop(columns='code departement')

In [32]:
df_insee[['departement']] = df_insee[['departement']].astype(str)

In [33]:
df_insee.head(1)

            departement  code insee dep
0  Pyrenees-Atlantiques             640

In [34]:
df_insee.drop_duplicates(keep='first', inplace=True)

In [35]:
df_insee.shape

(101, 2)

## Join the dataframes

In [36]:
data = pd.merge(df_usagers, df_vehicules, how='left',on=['Num_Acc'])

In [37]:
data = pd.merge(data, df_caracteristiques, how='left',on=['Num_Acc'])

In [38]:
data = pd.merge(data, df_lieux, how='left',on=['Num_Acc'])

In [39]:
data = pd.merge(data, df_insee, how='left', left_on=['dep'], right_on=['code insee dep'])

In [40]:
data.tail()

,Num_Acc,grav,catv,lum,dep,atm,col,lat,long,annee,date,plan,departement,code insee dep
2087165,201700060700,4,7,1,976,1,3,12.76210,45.22609,2017,28/11/2017,1,NaN,NaN
2087166,201700060700,4,31,1,976,1,3,12.76210,45.22609,2017,28/11/2017,1,NaN,NaN
2087167,201700060700,4,7,1,976,1,3,12.76210,45.22609,2017,28/11/2017,1,NaN,NaN
2087168,201700060700,4,31,1,976,1,3,12.76210,45.22609,2017,28/11/2017,1,NaN,NaN
2087169,201700060701,4,31,3,976,1,6,12.81342,45.20169,2017,30/11/2017,1,NaN,NaN

In [41]:
data.drop(columns=["dep","code insee dep"], inplace=True)

In [42]:
# We remove the rows without lattitude or longitude.
#data.dropna(axis=0, how='any', subset=['lat'], inplace=True)
#data.dropna(axis=0, how='any', subset=['long'], inplace=True)

In [43]:
for column in data.columns:
    na = sum(data[column].isna())
    print('{}: {}'.format(column,na))

Num_Acc: 0
grav: 0
catv: 0
lum: 0
atm: 224
col: 73
lat: 1107647
long: 1108198
annee: 0
date: 0
plan: 8036
departement: 63745

## Remove the latittude and longitude without sense

In [44]:
data2 = data.copy()
data2.dropna(axis=0,how='any',subset=['lat','long'],inplace=True)  # dropna
data2.head()

,Num_Acc,grav,catv,lum,atm,col,lat,long,annee,date,plan,departement
1,201000000002,1,7,1,1,6,50.516,2.920,2010,7/8/2010,1,Nord
2,201000000002,3,7,1,1,6,50.516,2.920,2010,7/8/2010,1,Nord
12,201000000004,3,1,1,1,6,50.518,2.925,2010,22/9/2010,1,Nord
13,201000000004,3,10,1,1,6,50.518,2.925,2010,22/9/2010,1,Nord
14,201000000004,1,1,1,1,6,50.518,2.925,2010,22/9/2010,1,Nord

In [45]:
data2 = data2.groupby('departement').agg({'lat':['mean', 'std'], 
                         'long':['mean','std']})
data2.reset_index(inplace=True,drop=False)
data2.columns = ['departement','lat_mean','lat_std','long_mean','long_std']

In [46]:
data = pd.merge(data, data2,how='left',on='departement')

In [47]:
data['sigma_interval_lat']= (data['lat']-data['lat_mean'])/data['lat_std']
data['sigma_interval_long']= (data['long']-data['long_mean'])/data['long_std']

In [48]:
data.loc[data['sigma_interval_lat']>5,'lat']=np.nan
data.loc[data['sigma_interval_long']>5,'long']=np.nan
data.loc[data['sigma_interval_lat']<-5,'lat']=np.nan
data.loc[data['sigma_interval_long']<-5,'long']=np.nan

In [49]:
#data[(data['departement']=='Sarthe') & (data['lat']<43)]

In [50]:
data = data.loc[:,:'departement']

In [51]:
data.head()

,Num_Acc,grav,catv,lum,atm,col,lat,long,annee,date,plan,departement
0,201000000001,3,30,1,1,6,NaN,NaN,2010,12/6/2010,1,Nord
1,201000000002,1,7,1,1,6,50.516,2.92,2010,7/8/2010,1,Nord
2,201000000002,3,7,1,1,6,50.516,2.92,2010,7/8/2010,1,Nord
3,201000000003,3,33,1,1,5,NaN,NaN,2010,11/9/2010,1,Nord
4,201000000003,3,7,1,1,5,NaN,NaN,2010,11/9/2010,1,Nord

# Export the data

In [52]:
data.shape

(2087170, 12)

In [53]:
data.to_csv('data.csv',sep='\t')
df_insee.to_csv('code-postal-code-insee-2015-modified.csv', sep='\t')

In [54]:
print("Done")

Done